{
  "home": "Home",
  "projects": "Projects",
  "blog": "Blog",
  "contact": "Contact",
  "downloadCV": "Download CV",
  "greeting": "Hello & welcome, I'm ",
  "tagline": "Junior Full-Stack Dev · ",
  "specializations": ["React", "Java", "Docker", "Integration"],
  "projectCollection": "A collection of projects that showcase my technical skills and passion for creating impactful solutions.",
  "projectList": [
    {
      "title": "Flowtrack",
      "desc": "Time management calendar app with tasks and habit tracking capabilities.",
      "full_description": "Flowtrack is a full-stack application built with Next.js, Prisma, and Tailwind CSS. It helps users manage their tasks and habits through a clean, fast interface. The app also includes analytics that highlight patterns in daily activity, making it easier to understand progress and stay consistent.",
      "url": "https://flowtrack-ochre.vercel.app/",
      "pic_url": "/flowtrack2.png"
    },
    {
      "title": "Seal",
      "desc": "Social media platform where users can share ideas and messages in real time.",
      "full_description": "Seal is a Twitter-like app where users can share short posts, find and befriend other users, and interact through comments and likes. It’s built with Next.js and Supabase, which enables real-time updates and a smooth, responsive experience.",
      "url": "https://the-seal.vercel.app/",
      "pic_url": "/seal.png"
    },
    {
      "title": "Intellipic-lite",
      "desc": "AI Text to image app that uses Seedream 4 for the creation of digital avatars.",
      "full_description": "Intellipic-lite is a text-to-image web app built with Next.js and Supabase. It’s a simplified remake of my original project, Intellipic, which allowed users to finetune a Stable Diffusion XL model with any subject. The new version removes the finetuning step entirely while still delivering equally strong results.",
      "url": "https://intellipic-lite.vercel.app/",
      "pic_url": "/intellipic-lite.png"
    }
  ],
  "skills": [
    "TypeScript",
    "Angular",
    "React",
    "Next.js",
    "TailwindCSS",
    "Java",
    "Spring Framework",
    "PostgreSQL",
    "MySQL",
    "Docker",
    "Microservices"
  ],
  "github": "GitHub",
  "linkedin": "LinkedIn",
  "viewProject": "View Project",
  "visitProject": "Visit project",
  "discuss": "Let's discuss how we can work together to bring your ideas to life.",
  "featuredProjects": "Featured Projects",
  "getInTouch": "Get in Touch",
  "sendMessage": "Send Message",
  "name": "Name",
  "email": "Email",
  "message": "Message",
  "fullName": "Your full name",
  "tellMe": "Tell me about your project or just say hello!",
  "footerText": "© 2025 {author}."
}