{
  "home": "Home",
  "projects": "Projects",
  "contact": "Contact",
  "downloadCV": "Download CV",
  "greeting": "Hello & welcome, I'm ",
  "tagline": "I build fast, modern web experiences with clean, modular code.",
  "specializations": ["React", "Java", "Docker", "Integration"],
  "projectCollection": "A collection of projects that showcase my technical skills and passion for creating impactful solutions.",
  "projectList": [
    {
      "title": "j1.wtf",
      "desc": "Realtime twitter-like web app made with React & Firebase.",
      "full_description": "This webapp was my first real coding project. I learned about the basics of react, hooks, the virtual DOM and different ways of routing. For the back-end I chose Firebase because it came with all I needed: Auth, storage and Database. Firebase uses it`s own non relational database called Firestore, which is a document based database similar to mongoDB.",
      "url": "https://j1-old.vercel.app/",
      "pic_url": "/j1wtf.png"
    },
    {
      "title": "Intellipic",
      "desc": "AI-powered image generator with fine-tuning.",
      "full_description": "Back when Text to Image AIs where starting to become a thing, a friend and I thought of this app idea, inspired by Lensa. We wanted to create AI avatars for social media. We used Next.js and Supabase and for the AI we ended up using Replicate, a SaaS that allows us to finetune and infere AI models that used a base image of Stable Diffusion XL.",
      "url": "https://intellipic.vercel.app/",
      "pic_url": "/intellipic.png"
    },
    {
      "title": "Erasmus Project at CGI",
      "desc": "Full-stack app with Spring Boot, Angular, PostgreSQL, Docker.",
      "full_description": "This was my Internship Project that I made along three other colleagues. The idea was to make an app that allowed HR employees to construct standardized job proposals for controlled salary estimation calculations. We used Angular for the front-end, Java Springboot for the back-end connected to postgress, all containerized with docker along another microservice to display the job proposals in a downloadable PDF.",
      "url": "https://github.com/j1-dev/erasmus",
      "pic_url": "/CGI.png"
    },
    {
      "title": "Flowtrack",
      "desc": "Full-stack Next.js app with prisma and tailwindcss for tracking tasks and habits.",
      "full_description": "Flowtrack is a full-stack application built with Next.js, Prisma, and Tailwind CSS. It allows users to track their tasks and habits efficiently, providing a modern and responsive user interface, as well as analytics that provide feedback on their day to day progress.",
      "url": "https://flowtrack-ochre.vercel.app/",
      "pic_url": "/flowtrack2.png"
    },
    {
      "title": "Seal",
      "desc": "Next.js 15 & Supabase remake of my first project.",
      "full_description": "Seal is my latest project and I decided to make it as a way to see what would happen if I was to implement my first project idea again. I used Next.js instead of React and Supabase instead of Firebase, because I wanted to use an SQL database this time. ",
      "url": "https://the-seal.vercel.app/",
      "pic_url": "seal.png"
    },
    {
      "title": "Intellipic-lite",
      "desc": "Lightweight version of Intellipic with Next.js and Supabase.",
      "full_description": "Intellipic-lite is a simplified version of the original Intellipic app, built with Next.js and Supabase. It retains the core functionality of AI-generated avatars while streamlining the user experience and reducing resource consumption.",
      "url": "https://intellipic-lite.vercel.app/",
      "pic_url": "intellipic-lite.png"
    }
  ],
  "skills": [
    "TypeScript",
    "Angular",
    "React",
    "Next.js",
    "TailwindCSS",
    "Java",
    "Spring Framework",
    "PostgreSQL",
    "MySQL",
    "Docker",
    "Microservices"
  ],
  "github": "GitHub",
  "linkedin": "LinkedIn",
  "viewProject": "View Project",
  "visitProject": "Visit project",
  "discuss": "Let's discuss how we can work together to bring your ideas tolife.",
  "featuredProjects": "Featured Projects",
  "getInTouch": "Get in Touch",
  "sendMessage": "Send Message",
  "name": "Name",
  "email": "Email",
  "message": "Message",
  "fullName": "Your full name",
  "tellMe": "Tell me about your project or just say hello!",
  "footerText": "© 2025 {author}."
}