{
  "home": "Inicio",
  "projects": "Proyectos",
  "blog": "Blog",
  "contact": "Contacto",
  "downloadCV": "Descargar CV",
  "greeting": "Hola y bienvenido, soy ",
  "tagline": "Junior Full-Stack Dev · ",
  "specializations": ["React", "Java", "Docker", "Integración"],
  "projectCollection": "Una colección de proyectos que muestran mis habilidades técnicas y mi pasión por crear soluciones efectivas.",
  "projectList": [
    {
      "title": "Flowtrack",
      "desc": "Aplicación full-stack para el seguimiento de tareas y hábitos.",
      "full_description": "Flowtrack es una aplicación full-stack desarrollada con Next.js, Prisma y Tailwind CSS. Permite a los usuarios gestionar sus tareas y hábitos desde una interfaz rápida y clara. Además, incluye analíticas que muestran patrones en la actividad diaria, ayudando a entender el progreso y mantener la constancia.",
      "url": "https://flowtrack-ochre.vercel.app/",
      "pic_url": "/flowtrack2.png"
    },
    {
      "title": "Seal",
      "desc": "Remake con Next.js 15 y Supabase de mi primer proyecto.",
      "full_description": "Seal es una aplicación similar a Twitter donde los usuarios pueden compartir mensajes cortos, encontrar y añadir a otros usuarios como amigos, e interactuar mediante comentarios y “me gusta”. Está desarrollada con Next.js y Supabase, lo que permite actualizaciones en tiempo real y una experiencia fluida.",
      "url": "https://the-seal.vercel.app/",
      "pic_url": "/seal.png"
    },
    {
      "title": "Intellipic-lite",
      "desc": "Aplicación de IA 'text to image' que usa Seedream 4 para la creación de avatares digitales.",
      "full_description": "Intellipic-lite es una aplicación web de texto a imagen desarrollada con Next.js y Supabase. Es una versión simplificada de mi proyecto original, Intellipic, que permitía afinar un modelo Stable Diffusion XL con cualquier sujeto. En esta nueva versión ya no es necesario realizar ese proceso y los resultados siguen siendo igual de buenos.",
      "url": "https://intellipic-lite.vercel.app/",
      "pic_url": "/intellipic-lite.png"
    }
  ],
  "skills": [
    "TypeScript",
    "Angular",
    "React",
    "Next.js",
    "TailwindCSS",
    "Java",
    "Spring Framework",
    "PostgreSQL",
    "MySQL",
    "Docker",
    "Microservicios"
  ],
  "github": "GitHub",
  "linkedin": "LinkedIn",
  "viewProject": "Ver Proyecto",
  "visitProject": "Visitar proyecto",
  "featuredProjects": "Proyectos Destacados",
  "getInTouch": "Contacta conmigo",
  "sendMessage": "Enviar Mensaje",
  "discuss": "Hablemos sobre cómo podemos trabajar juntos para dar vida a tus ideas.",
  "name": "Nombre",
  "email": "Correo",
  "message": "Mensaje",
  "fullName": "Tu nombre completo",
  "tellMe": "¡Cuéntame sobre tu proyecto o simplemente saluda!",
  "footerText": "© 2025 {author}."
}